Revit 2026 API

# LineScaling Enumeration

---

An enumerated type listing possible LineType scaling modes.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum LineScaling
```
```vb
Public Enumeration LineScaling
```
```cpp
public enum class LineScaling
```
```fsharp
type LineScaling
```

| Member name | Value | Description |
| --- | --- | --- |
| ModelSpace | 1 | Modelspace scaling. LTSCALE is set to view scale and PSLTSCALE to 0. |
| PaperSpace | 2 | Paperspace scaling. Specifies the value 1 for both LTSCALE and PSLTSCALE. |
| ViewScale | 0 | Exporting lines as they were scaled by view scale. This option preserves visual fidelity. |

Whichever option is chosen, line type definitions are created so a dashed line always begins and ends with a dash. Using these options does change the default behavior of exported DWGs. Some lines expected to be dashed may appear solid or in a different scale.

#### Reference

Autodesk.Revit.DB Namespace